SORT FIELDS=(8,5,CH,A)                                   
OUTREC FIELDS=(C'FIELD SPEC',                           
               11:1,7,                                  
               22:X,                                    
               C'ALPHA',                                
               8,5,                                     
               40:Z,                                    
               3C'XYZ',                                 
               X'7B',                                   
               6Z,                                      
               2X'3C2B3E',                              
               X'7D',                                   
               32,7,                                    
               8X,                                      
               C'+',                                    
               11X)                                     
USE  dd_infile1  RECORD F,90 ORG SQ                     
GIVE dd_outfile  RECORD F,90 ORG SQ                     
