SORT FIELDS=(8,5,CH,A)                                                          
USE  dd_infile   RECORD F,90 ORG SQ                                            
GIVE dd_outfile  RECORD F,90 ORG SQ     
OUTFIL FILES=dd_outfil1,                 
OUTREC=        (1,7,                    
               32,7,                    
               20,8,                    
               16,4,                    
               28,4,                    
               13,3,                    
                8,5,                    
               39,4, *   FL COMP-1  
               43,7, *   CLO                                                  
               50,8, *   CST                                                  
               58,8, *   CSL                                                  
               66,25)*   Filler                                               
