 MERGE FIELDS=(28,5,CH,A)                      
 OUTREC FIELDS=(C'FIELD SPEC',                 
                11:11,7,                       
                22:X,                          
                C'ALPHA',                      
                28,5,                          
                40:Z,                          
                3C'XYZ',                       
                X'7B',                         
                6Z,                            
                2X'3C2B3E',                    
                X'7D',                         
                64,7,                          
                8X,                            
                C'+',                          
                11X)                           
 USE  dd_infile1  RECORD F,90 ORG SQ           
 USE  dd_infile2  RECORD F,90 ORG SQ           
 USE  dd_infile3  RECORD F,90 ORG SQ           
 GIVE dd_outfile  RECORD F,90 ORG SQ           
