SORT FIELDS=(8,5,CH,A)                               
USE  dd_infile     RECORD F,90 ORG SQ                
GIVE dd_outfile    RECORD F,90 ORG SQ                
OUTREC FIELDS(1,7,    
              32,7,   
              20,8,   
              16,4,   
              28,4,   
              13,3,   
               8,5,   
              39,4,   
              43,7,   
              50,8,   
              58,8,   
              66,25)  
