SORT FIELDS=(8,5,CH,A)                             
USE  dd_infile     RECORD F,90 ORG SQ              
GIVE dd_outfile    RECORD F,90 ORG SQ              
OMIT COND=(8,2,CH,LE,C'MM',AND,13,3,BI,GT,-10,OR,16,4,FI,GT,10,AND,20,8,FL,LE,40,OR,28,4,PD,LE,10,AND,32,7,ZD,GE,15)
OUTREC FIELDS=(C'FIELD SPEC',               
               11:1,7,                      
               22:X,                        
               C'ALPHA',                    
               8,5,                         
               40:Z,                        
               3C'XYZ',                     
               X'7B',                       
               6Z,                          
               2X'3C2B3E',                  
               X'7D',                       
               32,7,                        
               8X,                          
               C'+',                        
               11X)                         
