SORT FIELDS=(8,5,CH,A)                                     
USE  dd_infile     RECORD F,90 ORG SQ                      
GIVE dd_outfile    RECORD F,90 ORG SQ                      
INCLUDE COND=(8,2,CH,GT,C'GG',AND,13,3,BI,GT,10,AND,16,4,FI,LT,40,AND,20,8,FL,GT,10,AND,28,4,PD,GT,10,AND,32,7,ZD,LT,40)
SUM FIELDS=(NONE)                                          
OPTION SKIPREC=5                                           
STOPAFT=15                                                 
