      *  check if defined environment variables
           move 'dd_infile'  to env-pgm
           perform check-env-var
      *  check if defined environment variables
           move 'dd_outfile'  to env-pgm
           perform check-env-var
      *  check if defined environment variables
           move 'dd_sortwork'  to env-pgm
           perform check-env-var

