      *  check if defined environment variables
           move 'dd_infile1'  to env-pgm
           perform check-env-var
      *  check if defined environment variables
           move 'dd_infile2'  to env-pgm
           perform check-env-var
      *  check if defined environment variables
           move 'dd_infile3'  to env-pgm
           perform check-env-var
      *  check if defined environment variables
           move 'dd_outfile'  to env-pgm
           perform check-env-var
      *  check if defined environment variables
           move 'dd_mergework'  to env-pgm
           perform check-env-var      
