      *-------------------------------------------------------------------------------*
      * **********************************************************
      *  GCSORT Tests
      * **********************************************************
      * Author:    Sauro Menna
      * Date:      20160821
      * License
      *    Copyright 2016 Sauro Menna
      *    GNU Lesser General Public License, LGPL, 3.0 (or greater)
      * Purpose:   Sort COBOL module
      * *********************************************
      *-------------------------------------------------------------------------------*
      *  copy   prtotout.cpy
           move Tot-bi-field    to out-bi-field 
           move Tot-fi-field    to out-fi-field 
           move Tot-fl-field    to out-fl-field 
           move Tot-pd-field    to out-pd-field 
           move Tot-zd-field    to out-zd-field 
           move Tot-fl-field-1  to out-fl-field-1 
           move Tot-clo-field   to out-clo-field  
           move Tot-cst-field   to out-cst-field  
           move Tot-csl-field   to out-csl-field  
