      *-------------------------------------------------------------------------------*
      * **********************************************************
      *  GCSORT Tests
      * **********************************************************
      * Author:    Sauro Menna
      * Date:      20160821
      * License
      *    Copyright 2016 Sauro Menna
      *    GNU Lesser General Public License, LGPL, 3.0 (or greater)
      * Purpose:   Sort COBOL module
      * *********************************************
      *-------------------------------------------------------------------------------*
      *  copy   przerotot.cpy
           move zero to Tot-bi-field
           move zero to Tot-fi-field
           move zero to Tot-fl-field
           move zero to Tot-pd-field
           move zero to Tot-zd-field
           move zero to Tot-fl-field-1
           move zero to Tot-clo-field 
           move zero to Tot-cst-field 
           move zero to Tot-csl-field 
           
