 SORT FIELDS=(8,5,CH,A)                                               
 USE  dd_infile     RECORD F,90 ORG SQ                                
 GIVE dd_outfile    RECORD F,90 ORG SQ                                
 OMIT COND=(8,2,CH,LE,C'MM',AND,13,3,BI,GT,-10,OR,16,4,FI,GT,10,AND,20,8,FL,LE,40,OR,28,4,PD,LE,10,AND,32,7,ZD,GE,15)
 SUM FIELDS=(13,3,BI,     
             16,4,FI,     
             20,8,FL,     
             28,4,PD,     
             32,7,ZD,     
             39,4,FL,     
             43,7,CLO,    
             50,8,CST,    
             58,8,CSL)    
