 01 text-1                             pic x(30)
                                       value "Welcome in Hotel Moon!".
 01 price                              pic 9(3).
 01 price-disp                         pic ZZ9.
 01 room                               pic 9(3) value 39.
 01 breakfast                          pic 9(3) value 3.
