      *-------------------------------------------------------------------------------*
      * **********************************************************
      *  OCSort Tests
      * **********************************************************
      * Author:    Sauro Menna
      * Date:      20160821
      * License
      *    Copyright 2016 Sauro Menna
      *    GNU Lesser General Public License, LGPL, 3.0 (or greater)
      * Purpose:   Sort COBOL module
      * *********************************************
      *-------------------------------------------------------------------------------*
      * copy prinrsrt01.cpy
           move in-seq-record  to srt-seq-record
           move in-ch-field    to srt-ch-field   
           move in-bi-field    to srt-bi-field   
           move in-fi-field    to srt-fi-field   
           move in-fl-field    to srt-fl-field   
           move in-pd-field    to srt-pd-field   
           move in-zd-field    to srt-zd-field   
           move in-fl-field-1  to srt-fl-field-1 
           move in-clo-field   to srt-clo-field  
           move in-cst-field   to srt-cst-field  
           move in-csl-field   to srt-csl-field  
