      *-------------------------------------------------------------------------------*
      * **********************************************************
      *  OCSort Tests
      * **********************************************************
      * Author:    Sauro Menna
      * Date:      20160821
      * License
      *    Copyright 2016 Sauro Menna
      *    GNU Lesser General Public License, LGPL, 3.0 (or greater)
      * Purpose:   Sort COBOL module
      * *********************************************
      *-------------------------------------------------------------------------------*
      * copy prsrtout.cpy
           move srt-seq-record to out-seq-record
           move srt-ch-field   to out-ch-field   
           move srt-bi-field   to out-bi-field   
           move srt-fi-field   to out-fi-field   
           move srt-fl-field   to out-fl-field   
           move srt-pd-field   to out-pd-field   
           move srt-zd-field   to out-zd-field   
           move srt-fl-field-1 to out-fl-field-1 
           move srt-clo-field  to out-clo-field  
           move srt-cst-field  to out-cst-field  
           move srt-csl-field  to out-csl-field  
